# TASK #1: DEFINE SINGLE AND MULTI-DIMENSIONAL  NUMPY ARRAYS

In [32]:
import numpy as np

In [36]:
# NumPy is a Linear Algebra Library used for multidimensional arrays
# NumPy brings the best of two worlds: (1) C/Fortran computational efficiency, (2) Python language easy syntax 
list_1=[1,2,3,4,5,6]
list_1=np.array(list_1)
# Let's define a one-dimensional array 
array=np.array([1,2,34,5])
print(list_1)
# list_1
type(list_1)

[1 2 3 4 5 6]

numpy.ndarray

In [ ]:
# Let's create a numpy array from the list "my_list"

In [45]:
# Multi-dimensional (Matrix definition)
my_matrix=np.array([[2,3,4,5],[5,6,78,5]])
my_matrix

array([[ 2,  3,  4,  5],
       [ 5,  6, 78,  5]])

MINI CHALLENGE #1: 
- Write a code that creates the following 2x4 numpy array

```
[[3 7 9 3] 
[4 3 2 2]]
```

In [48]:
c1=np.array([[3,7,9,3],[4,3,2,2]])
print(c1)
type(c1)

[[3 7 9 3]
 [4 3 2 2]]

numpy.ndarray

# TASK #2: LEVERAGE NUMPY BUILT-IN METHODS AND FUNCTIONS

In [49]:
# "rand()" uniform distribution between 0 and 1
x=np.random.rand(20)
x

array([0.98591448, 0.53657714, 0.56200152, 0.09515122, 0.16745552,
       0.82449263, 0.12779976, 0.97491658, 0.27277207, 0.535552  ,
       0.31059964, 0.09386708, 0.87096615, 0.89026602, 0.55110742,
       0.95584194, 0.26116079, 0.01461415, 0.59956196, 0.61365036])

In [50]:
# you can create a matrix of random number as well
x=np.random.rand(3,3)
x

array([[0.65571287, 0.83242738, 0.51282503],
       [0.79868025, 0.36705005, 0.69031891],
       [0.5634533 , 0.5681617 , 0.05276662]])

In [53]:
# "randint" is used to generate random integers between upper and lower bounds
x= np.random.randint(1,50)
x

33

In [56]:
# "randint" can be used to generate a certain number of random itegers as follows
x=np.random.randint(1,100,5)
print(x)

[17 95 80 85 68]

In [60]:
# np.arange creates an evenly spaced values within a given interval
x=np.arange(1, 50)
# print(x)
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49])

In [63]:
# create a diagonal of ones and zeros everywhere else
x=np.eye(7)
print(x)

[[1. 0. 0. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0.]
 [0. 0. 1. 0. 0. 0. 0.]
 [0. 0. 0. 1. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 0. 0. 1.]]

In [65]:
# Matrix of ones
x=np.ones((7,7))
print(x)

[[1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1.]]

In [67]:
# Array of zeros
x=np.zeros((4,3))
print(x)

[[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]

MINI CHALLENGE #2:
- Write a code that takes in a positive integer "x" from the user and creates a 1x10 array with random numbers ranging from 0 to "x"

In [71]:
num=int(input("enter value_ "))
x=np.random.randint(1,10,num)
print(x)

[5 1 5 5 3 6 7 7 5 1]

# TASK #3: PERFORM MATHEMATICAL OPERATIONS IN NUMPY

In [74]:
# np.arange() returns an evenly spaced values within a given interval
x=np.arange(1, 10)
y=np.arange(1,10)
print(x,y)

[1 2 3 4 5 6 7 8 9] [1 2 3 4 5 6 7 8 9]

In [77]:
# Add 2 numpy arrays together
sum=x+y
print(sum)

[ 2  4  6  8 10 12 14 16 18]

In [78]:
squared=x**2
print(squared)

[ 1  4  9 16 25 36 49 64 81]

In [79]:
sqrt=np.sqrt(squared)
print(sqrt)

[1. 2. 3. 4. 5. 6. 7. 8. 9.]

In [81]:
z =np.exp(y)
print(z)

[2.71828183e+00 7.38905610e+00 2.00855369e+01 5.45981500e+01
 1.48413159e+02 4.03428793e+02 1.09663316e+03 2.98095799e+03
 8.10308393e+03]

MINI CHALLENGE #3:
- Given the X and Y values below, obtain the distance between them

```
X = [5, 7, 20]
Y = [9, 15, 4]
```

In [101]:
X =np.array( [5, 7, 20])
Y =np.array( [9, 15, 4])
# distance=np.linalg.norm(X-Y)
distance=np.sqrt(X**2 +Y**2)
print((distance))
# X-Y

[10.29563014 16.55294536 20.39607805]

# TASK #4: PERFORM ARRAYS SLICING AND INDEXING

In [103]:
# Access specific index from the numpy array
my_nparray=np.array([1,2,4,5,67,80])
print(my_nparray)

[ 1  2  4  5 67 80]

In [108]:
# Starting from the first index 0 up until and NOT including the last element
# my_nparray[0:-1]
my_nparray[0]
print(my_nparray[0:3])

[1 2 4]

In [109]:
# Broadcasting, altering several values in a numpy array at once
my_nparray[0:4]=7
print(my_nparray)

[ 7  7  7  7 67 80]

In [110]:
# Let's define a two dimensional numpy array
matrix=np.random.randint(1,10,(4,4))
print(matrix)

[[4 6 1 4]
 [9 9 5 7]
 [9 4 6 3]
 [3 3 8 7]]

In [113]:
# Get a row from a mtrix
print(matrix[0])
print(matrix[-1])

[4 6 1 4]
[3 3 8 7]

In [114]:
# Get one element
matrix[0][2]

1

MINI CHALLENGE #4:
- In the following matrix, replace the last row with 0

```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [118]:
X=np.array([[2,30,20,-2,-4],[3,4,40,-3,-2],[-3,4,-6,90,10],[25, 45, 34, 22, 12]])
print(X)
X[-1]=0
print(X)

[[ 2 30 20 -2 -4]
 [ 3  4 40 -3 -2]
 [-3  4 -6 90 10]
 [25 45 34 22 12]]
[[ 2 30 20 -2 -4]
 [ 3  4 40 -3 -2]
 [-3  4 -6 90 10]
 [ 0  0  0  0  0]]

# TASK #5: PERFORM ELEMENTS SELECTION (CONDITIONAL)

In [119]:
matrix=np.random.randint(1,10,(5,5))
print(matrix)

[[8 9 8 7 8]
 [3 4 3 7 9]
 [7 5 1 1 3]
 [5 5 3 9 5]
 [9 1 4 9 5]]

In [120]:
new_matrix=matrix[matrix > 7]
print((new_matrix))

[8 9 8 8 9 9 9 9]

In [126]:
# Obtain odd elements only
new_matrix =matrix[matrix % 2 ==1]
# print(np.mean(new_matrix))
print(new_matrix)

[9 7 3 3 7 9 7 5 1 1 3 5 5 3 9 5 9 1 9 5]

MINI CHALLENGE #5:
- In the following matrix, replace negative elements by 0 and replace odd elements with -2


```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [127]:
X=np.array([[2,30,20,-2,-4],[3,4,40,-3,-2],[-3,4,-6,90,10],[25,45,34,22,12,],[13,24,22,32,37]])
print(X)

[[ 2 30 20 -2 -4]
 [ 3  4 40 -3 -2]
 [-3  4 -6 90 10]
 [25 45 34 22 12]
 [13 24 22 32 37]]

In [128]:
X[X<0]=0
X[ X%2 ==1]=-2
print(X)

[[ 2 30 20  0  0]
 [-2  4 40  0  0]
 [ 0  4  0 90 10]
 [-2 -2 34 22 12]
 [-2 24 22 32 -2]]

# TASK #6: UNDERSTAND PANDAS FUNDAMENTALS

In [21]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [129]:
import pandas as pd

In [131]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df =pd.DataFrame({'Bank Client ID':[111,222,333,444],'Bank Client Name':['Chanel','Steve','Mitch','rayan'],
'Net Worth[$]':[3500,29000,10000,2000],
 'Years with bank':[3,4,9,5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth[$]  Years with bank
0             111           Chanel          3500                3
1             222            Steve         29000                4
2             333            Mitch         10000                9
3             444            rayan          2000                5

In [141]:
bank_client_df.describe()

       Bank Client ID  Net Worth[$]  Years with bank
count        4.000000      4.000000         4.000000
mean       277.500000  11125.000000         5.250000
std        143.300384  12412.191587         2.629956
min        111.000000   2000.000000         3.000000
25%        194.250000   3125.000000         3.750000
50%        277.500000   6750.000000         4.500000
75%        360.750000  14750.000000         6.000000
max        444.000000  29000.000000         9.000000

In [132]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [135]:
# you can only view the first couple of rows using .head()
bank_client_df.head(2)

   Bank Client ID Bank Client Name  Net Worth[$]  Years with bank
0             111           Chanel          3500                3
1             222            Steve         29000                4

In [136]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail(2)

   Bank Client ID Bank Client Name  Net Worth[$]  Years with bank
2             333            Mitch         10000                9
3             444            rayan          2000                5

MINI CHALLENGE #6:
- A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)
- Calculate the total value of the porfolio including all stocks

In [138]:
portfolio_df=pd.DataFrame({'stock ticker symbol':['AAPL','AMZN','T'],
                           'price per share [$]':[3500,200,40],
                           'Number of stocks':[3,4,9]})
portfolio_df

  stock ticker symbol  price per share [$]  Number of stocks
0                AAPL                 3500                 3
1                AMZN                  200                 4
2                   T                   40                 9

In [140]:
stocks_value=portfolio_df['price per share [$]']*portfolio_df['Number of stocks']
stocks_value.sum()

11660

# TASK #7: PANDAS WITH CSV AND HTML DATA

In [144]:
# Pandas is used to read a csv file and store data in a DataFrame
house_price_df=pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')
house_price_df[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [145]:
house_price_df[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [27]:
# Read tabular data using read_html

MINI CHALLENGE #7:
- Write a code that uses Pandas to read tabular US retirement data
- You can use data from here: https://www.ssa.gov/oact/progdata/nra.html

In [148]:
riterement_df=pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
riterement_df[0]

,Year of birth,Age
0,1937 and prior,65
1,1938,65 and 2 months
2,1939,65 and 4 months
3,1940,65 and 6 months
4,1941,65 and 8 months
5,1942,65 and 10 months
6,1943-54,66
7,1955,66 and 2 months
8,1956,66 and 4 months
9,1957,66 and 6 months
10,1958,66 and 8 months
11,1959,66 and 10 months
12,1960 and later,67
13,Notes: 1. Persons born on January 1 of any yea...,Notes: 1. Persons born on January 1 of any yea...

# TASK #8: PANDAS OPERATIONS

In [149]:
# Let's define a dataframe as follows:
bank_client_df =pd.DataFrame({'Bank Client ID':[111,222,333,444],'Bank Client Name':['Chanel','Steve','Mitch','rayan'],
                              'Net Worth[$]':[3500,29000,10000,2000],
                              'Years with bank':[3,4,9,5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth[$]  Years with bank
0             111           Chanel          3500                3
1             222            Steve         29000                4
2             333            Mitch         10000                9
3             444            rayan          2000                5

In [150]:
df_loyal=bank_client_df[bank_client_df['Years with bank']>=5]
df_loyal

   Bank Client ID Bank Client Name  Net Worth[$]  Years with bank
2             333            Mitch         10000                9
3             444            rayan          2000                5

In [29]:
# Pick certain rows that satisfy a certain criteria

In [151]:
# Delete a column from a DataFrame
del bank_client_df['Bank Client ID']
bank_client_df

  Bank Client Name  Net Worth[$]  Years with bank
0           Chanel          3500                3
1            Steve         29000                4
2            Mitch         10000                9
3            rayan          2000                5

MINI CHALLENGE #8:
- Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000 
- What is the combined networth for all customers with 5000+ networth?

In [156]:
networth_df=bank_client_df[bank_client_df['Net Worth[$]']>=5000]
networth_df

  Bank Client Name  Net Worth[$]  Years with bank
1            Steve         29000                4
2            Mitch         10000                9

In [157]:
networth_df['Net Worth[$]'].sum()

39000

# TASK #9: PANDAS WITH FUNCTIONS

In [158]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'], 
                               'Net worth [$]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [160]:
# Define a function that increases all clients networth (stocks) by a fixed value of 20% (for simplicity sake) 
def networth(balance):
    return balance *1.2

In [161]:
# You can apply a function to the DataFrame 
bank_client_df['Net worth [$]'].apply(networth)

0     4200.0
1    34800.0
2    12000.0
3     2400.0
Name: Net worth [$], dtype: float64

In [162]:
bank_client_df['Bank Client Name'].apply(len)

0    6
1    5
2    5
3    4
Name: Bank Client Name, dtype: int64

MINI CHALLENGE #9:
- Define a function that triples the stock prices and adds $200
- Apply the function to the DataFrame
- Calculate the updated total networth of all clients combined

In [164]:
def triple_stock(price):
    return price*3 +200
bank_client_df['Net worth [$]'].apply(triple_stock)

0    10700
1    87200
2    30200
3     6200
Name: Net worth [$], dtype: int64

# TASK #10: PERFORM SORTING AND ORDERING IN PANDAS

In [165]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'], 
                               'Net worth [$]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [166]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by='Years with bank')

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [167]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True
bank_client_df.sort_values(by='Years with bank',inplace=True)

In [168]:
# Set inplace = True to ensure that change has taken place in memory 
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [ ]:
# Note that now the change (ordering) took place

# TASK #11: PERFORM CONCATENATING AND MERGING WITH PANDAS

In [ ]:
# Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [169]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                 index=[0,1,2,3])

In [170]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [173]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                 index=[0,1,2,3])
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [174]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

# TASK #12: PROJECT AND CONCLUDING REMARKS

- Define a dataframe named 'Bank_df_1' that contains the first and last names for 5 bank clients with IDs = 1, 2, 3, 4, 5 
- Assume that the bank got 5 new clients, define another dataframe named 'Bank_df_2' that contains a new clients with IDs = 6, 7, 8, 9, 10
- Let's assume we obtained additional information (Annual Salary) about all our bank customers (10 customers) 
- Concatenate both 'bank_df_1' and 'bank_df_2' dataframes
- Merge client names and their newly added salary information using the 'Bank Client ID'
- Let's assume that you became a new client to the bank
- Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.
- Add this new dataframe to the original dataframe 'bank_df_all'.

In [200]:
raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5'],
           'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'],
           'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}
bank_df_1=pd.DataFrame(raw_data,columns=['Bank Client ID','First Name','Last Name'])
# bank_df_1=pd.DataFrame(raw_data)
bank_df_1

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [201]:
raw_data = {
        'Bank Client ID': ['6', '7', '8', '9', '10'],
        'First Name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'],
        'Last Name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
bank_df_2=pd.DataFrame(raw_data,columns=['Bank Client ID','First Name','Last Name'])
bank_df_2

  Bank Client ID First Name  Last Name
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [202]:
raw_data = {
    'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
    'Annual Salary [$/year]': [25000, 35000, 45000, 48000, 49000, 32000, 33000, 34000, 23000, 22000]}
bank_df_salary=pd.DataFrame(raw_data,columns=['Bank Client ID','Annual Salary [$/year]'])
bank_df_salary

  Bank Client ID  Annual Salary [$/year]
0              1                   25000
1              2                   35000
2              3                   45000
3              4                   48000
4              5                   49000
5              6                   32000
6              7                   33000
7              8                   34000
8              9                   23000
9             10                   22000

In [204]:
bank_df_all=pd.concat([bank_df_1,bank_df_2])
bank_df_all

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [205]:
bank_df_all=pd.merge(bank_df_all,bank_df_salary,on='Bank Client ID')
bank_df_all

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                   25000
1              2       Alex        Ali                   35000
2              3       Shep     George                   45000
3              4        Max      Mitch                   48000
4              5      Allen      Steve                   49000
5              6       Bill  Christian                   32000
6              7       Dina         Mo                   33000
7              8      Sarah      Steve                   34000
8              9    Heather        Bob                   23000
9             10      Holly   Michelle                   22000

In [206]:
new_client={'Bank Client ID':['11'],
            'First Name':['Rayan'],
            'Last Name':['Ahemd'],
            'Annual Salary [$/year]':[5000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name','Annual Salary [$/year]'])
new_client_df

  Bank Client ID First Name Last Name  Annual Salary [$/year]
0             11      Rayan     Ahemd                    5000

In [208]:
new_df=pd.concat([bank_df_all,new_client_df],axis=0)
new_df

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                   25000
1              2       Alex        Ali                   35000
2              3       Shep     George                   45000
3              4        Max      Mitch                   48000
4              5      Allen      Steve                   49000
5              6       Bill  Christian                   32000
6              7       Dina         Mo                   33000
7              8      Sarah      Steve                   34000
8              9    Heather        Bob                   23000
9             10      Holly   Michelle                   22000
0             11      Rayan      Ahemd                    5000

# EXCELLENT JOB!

# MINI CHALLENGES SOLUTIONS

MINI CHALLENGE #1 SOLUTION: 
- Write a code that creates the following 2x4 numpy array

```
[[3 7 9 3] 
[4 3 2 2]]
```

In [ ]:
x = np.array([[[3, 7, 9, 3] , [4, 3, 2, 2]]])
x

MINI CHALLENGE #2 SOLUTION:
- Write a code that takes in a positive integer "x" from the user and creates a 1x10 array with random numbers ranging from 0 to "x"

In [ ]:
x = int(input("Please enter a positive integer value: "))
x = np.random.randint(1, x, 10)
x

MINI CHALLENGE #3 SOLUTION:
- Given the X and Y values below, obtain the distance between them


```
X = [5, 7, 20]
Y = [9, 15, 4]
```

In [ ]:
X = np.array([5, 7, 20])
Y = np.array([9, 15, 4])
Z = np.sqrt(X**2 + Y**2)
Z

MINI CHALLENGE #4 SOLUTION:
- In the following matrix, replace the last row with 0

```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [ ]:
X = np.array([[2, 30, 20, -2, -4],
    [3, 4,  40, -3, -2],
    [-3, 4, -6, 90, 10],
    [25, 45, 34, 22, 12],
    [13, 24, 22, 32, 37]])

In [ ]:
X[4] = 0
X

MINI CHALLENGE #5 SOLUTION:
- In the following matrix, replace negative elements by 0 and replace odd elements with -2


```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [ ]:
X = np.array([[2, 30, 20, -2, -4],
    [3, 4,  40, -3, -2],
    [-3, 4, -6, 90, 10],
    [25, 45, 34, 22, 12],
    [13, 24, 22, 32, 37]])

X[X<0] = 0
X[X%2==1] = -2
X

MINI CHALLENGE #6 SOLUTION:
- A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)
- Calculate the total value of the porfolio including all stocks

In [ ]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

In [ ]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

MINI CHALLENGE #7 SOLUTION:
- Write a code that uses Pandas to read tabular US retirement data
- You can use data from here: https://www.ssa.gov/oact/progdata/nra.html

In [ ]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

MINI CHALLENGE #8 SOLUTION:
- Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000 
- What is the combined networth for all customers with 5000+ networth?

In [ ]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

In [ ]:
df_high_networth['Net worth [$]'].sum()

MINI CHALLENGE #9 SOLUTION:
- Define a function that triples the stock prices and adds $200
- Apply the function to the DataFrame
- Calculate the updated total networth of all clients combined

In [ ]:
def networth_update(balance):
    return balance * 3 + 200

In [ ]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

In [ ]:
results.sum()

PROJECT SOLUTION:

In [ ]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5 

raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5'],
            'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'], 
            'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}

Bank_df_1 = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
Bank_df_1


# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data = {
        'Bank Client ID': ['6', '7', '8', '9', '10'],
        'First Name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'], 
        'Last Name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
Bank_df_2 = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
Bank_df_2


# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10 
raw_data = {
        'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
        'Annual Salary [$/year]': [25000, 35000, 45000, 48000, 49000, 32000, 33000, 34000, 23000, 22000]}
bank_df_salary = pd.DataFrame(raw_data, columns = ['Bank Client ID','Annual Salary [$/year]'])
bank_df_salary


# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
bank_df_all = pd.concat([Bank_df_1, Bank_df_2])
bank_df_all


# Let's merge all data on 'Bank Client ID'
bank_df_all = pd.merge(bank_df_all, bank_df_salary, on = 'Bank Client ID')
bank_df_all

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df